use axum::{
    response::Html,
    extract::Form,
    routing::{get, post},
    Router,
};
use tower_http::services::ServeDir;
use std::{collections::HashMap, net::SocketAddr};
use tokio::net::TcpListener;

#[tokio::main]
async fn main() {
    let app = Router::new()
    .route("/", get(handler))
    .route("/button", post(button_handler))
    .route("/age", post(to_age))
    .nest_service("/static", ServeDir::new("static"));

    let addr = SocketAddr::from(([127, 0, 0, 1], 3000));
    println!("Listening on http://{}", addr);

    let listener = TcpListener::bind(addr).await.unwrap();

    // FIX: use into_make_service() so axum can serve the Router
    axum::serve(listener, app.into_make_service())
        .await
        .unwrap();
}

async fn handler() -> Html<&'static str> {
    Html(include_str!("../static/index.html"))
}

async fn button_handler(Form(form): Form<HashMap<String, String>>) -> Html<String> {
    if form.get("button1").is_some() {
        Html(r#"
            <!DOCTYPE html>
            <html>
            <body>
                <h1>Me too!</h1>
                <form action="/age" method="post">
                    <button type="submit" name="age" value="submit">Next</button>
                </form>
            </body>
            </html>
        "#.to_string())
    } else {
        Html(r#"
            <!DOCTYPE html>
            <html lang="en">
            <head>
                <meta charset="UTF-8">
                <title>Response</title>
            </head>
            <body>
                <h1>What are you then...</h1> <p><strong>g̨͕̞̮̩̀̅̐̀ͦͤ͝͡_̸͖̟̰̼̿̓̀͆ẇ̶̧̢̱̪̤̤͇͈̰̗̜͑ͣ̎͋̄ͩͭ͊͜͢͠͠ͅs̡̯̻̟͕̍̀͒̿͐͛_̨͚͙̩̃͂͋̄͢ḑ̷̴̡̭̞͙̬̬̫̳̯̤̲̠̱̽̀͛ͤ̇̍̂̓̆̐͋͡͞gę͇̮͐̇̈́ͤ̚̕͠ŗ̷̵̙̻͓̘͉͎͈͖̈̀ͬ̇͌̄͂̌̐̽͜͠s̏s̩̺̯̺͚̒̈́s͈̠̻̜̩̤͙̳̍̐͒̔̒ş̶̡̤͙̥̥͔͇̭͍̤̘̬̖̱ͬ͊ͯ̂ͪ̆́̑͒̄̇̀͗̉̏ͧ̕͟͜͡͠͠h̴̛͓̬̳͓̓̐̆ͦ́̏̋͂̄ͧͪͨ̒̽̃̑͐ͅg̷̡̧̧̬̲̟̫̹̻̗̘͓̐͆͐̽̎ͧ̀͂̔̒͘͘͠_̮̰͖̯̿̄̊ͧ̎ͦu̴̻̹̥͑̉ͪ̌́ė̸̢̖̯̥̻̙̜̤̥͓̼̖̗̦͉̝̟͇͔̀̿ͮͦͧ̉͛ͬ̓̈̐͋̄ͦ͘͜͞͝s͛ḧ̟̭͚͌̐ṷ̷̡̡̧̨̬̟̲̦̞̺̣̺ͬͯ̍̂̃̓ͨ́̽ͪ̑̽̒ͫ̀͘̚͢͢e̴̷͈̹̦͇̗̝͍͚͕͕̒̌̆̒̒̃ͬ̈ͧ̂͒ͦ͗̃ͮͥ͂ͮͪ̃ͪ̓̕͠͞͝͝ŭ̵̶͙̖̯ͩ̊ͩh̨̨͔̖̖̥͈̠͉̲͔̹̺̲́̐̒̏ͫ̓̿͊̈́̀͆ͩͭ͆̀́͆̀ͬ͟͠ų̸̵̧̜̮̗̦̫̣̹͉̒̓̃̿́ͣ̌̓͐̅ͤ́ͮ͆̔͑̑͋̑͝͝͡ḩ̡͍͍͖̫̖̝̺͈͙̙̹͕̜̺̠͔͉̣̪̿̂̔͛͑̒ͨ̎̄̃̀̂̾ͣ͋͒͐̅̂̀̊͛ͦ͘u̴͖͎̬̙̲̜̠͉̭̠̤̲̇ͭ͌͌ͩ͆̇͡ͅ_̢̲͓̤̳̤̈́̅ͧ̅̾́̌ͫ̀̿́͋̍̒͜͞ͅȟ̢̡̛̖͉͓͈̼͖͉̹̹̗͈̣̦ͨͨͯ̿̈́ͭ̋̋͗̓̅͊̄̄̾͢͠͠ͅͅg͋f̸͖͖̰̙̜̺͓͖̃̿̽̀ͤ͘̕͢͡͠͝h̸̡̬̱͓̥̬̱̺̃̓̇͒̔u̶̧̧͇̫̠͚̺͍̓ͧ̆͗̀̊̏ͫ̑̅͋̑͌͒͟_̨̠͉̹̭̿͋̾ͣ̃͡ͅš̛͔̼͍̖̋͛͘̕͝͠͝d̸̨̫̪͒̾̋̚_̔u̴͍̲͍ͫ̆͆ͯ͢_̼̱̻͉_̨̮̰̠͇̰̰̼̆̅ͭ̓͗͂͆ͦ͆ͭ̅̕̚͝ģ̵̡̛̛̞̺̠̮̤̮͙̱͓̂͗̉͐ͮ̑̄͌͌ͨ̿͊ͧ̿̐̿̏̚͜͢͡ḩ̢̛̯̟͚̥̘̝̦͚̱̘̞̮̲̜̽͋ͭ̋̓͗ͭͯ̑ͤ̍̽͂ͦ̚s̷̴̢̨̨̧̛̥̙͉͎̼̭̠̠͓̥̥̈́͐͗̈̓̐́ͮ̕͜͢_̯͈̾ͬ͛͆ͮ͐g̢͉̯͇̝̳̱̼̚_̸̥̤́̄̏ḩ̴̸̷̨͖͙͍̻͉̟̜̞͕̣̬̰̬̯ͬͩ̊̈́̉̔̒ͬ͊̆̅̓̆̀͠e̥̫̬̹̯͛ͬ̏_̷̷̸̵̧̡̨̛̯̥̝͎ͥ͐ͭ̅̿͗̈̊ͬ̓͑͆ͤ̂ͭ̕͘͟͢͜͜ş̵̴͙̙̖̱̩̹̞̗̱̼̬͇̩̣̦̻̊͋͋ͯ̽̀ͬ̋͌̄͒͊̄́͘̚̚͢͞h̜ų̴̧̖͈̜̲͕̫̰͈͉̼̝͚̣̽͌̆͗̀ͥ̒͊͌̆̈́͌̄̓̿͂̄͘͘̕͟͟ų̴̴̛̛̘͍̫̹͕̼͖̻̰̬̪̥̦ͯͯ̍̐ͩͪ͊͂ͧ̅ͪ̓ͫ̀͂̃ͤ̈́̈̉͝͝͞_ͪ̌g̵̶̵̵̗̖̣̲̼̮̘̠͓͕̣̘̔͋ͥ̾́̋͛ͣ͂̒͐̀̾͘̚͜͟͟i̯͔̲̋̃̓̀͒ͅ_̶̢̲̺̙̠͍͚̟̀̿̿́̔͐́̄̓͆ͪ̂̒̿͢͟͡e̶̶̢̢̬̰͚̮͙͕̗͐̎͊͒ͣ̇̉̓̏ͫ̅͒̈̂̂͐̿̚͠ͅ_̱̫́̌ͦͨ̐͢͝ǐ̵̼̖̰̳̣̮̹͂͊ͪ̏̆͋ͨ̔ͬ̒͆͟͝ư̼̥͇ͭͭ̀͐̈́̍ͦͣ̽̒ḓ̷̴̠̲̟ͮͯͦͦͧ̊ͯͬ́ͥ̏͗͐̚s̷̛̤͍̰̥̹̰͍̲͇̪͙͕̲̖̀̍ͨ̽ͨ̎ͦ̇ͥ̔ͨ̇͑ͩ̊́̈́ͮͣ͊̏͗̇͢iͩ̋͜_̠͎̳̦̰̥̣̰̘̒͐͋̽̄͐ͪ̒̓́̕ͅͅ_̳̬ͮ̅͊̍ǔ̶̱̦̜͇̣̲͌ͭ͋̎ͅ_̖̰̭̪̙͚̩̜̇̄̽̇ͨͩ̀̍͞h͚̹̒͊̐̀̓ͧͫhu̧̳̬̪̜̬͉͖̦ͣͯ̅̒̚͟͝g̶̵̴̢̨̤̳̬̭̟̥̘̭͇̘̤͗̒͗ͣͭ́̒̂̌ͅí̵̡̻̼̬̮͎̗͈̯̟̠̱̜̇̔̃ͤͮ͗͐̇̉ͩ͊̑̍̀̕͟ư̷̴̡̗̻̞̖̲͙̞̳͐̆̀̈́ͫ̈̆̑̀́ͨ̊̚͘͢͡ȩ̨͔̭̹̪͍̳̭̫͉̲͙̫͈̱͉̖͕͓̅̎ͮͥͦͯ͊ͫ̽ͥͤ͐̍̓͆̎̄ͤ͘͢͢͝͡ͅͅs̨̧̛̪͔̗̈ͦ͗͊ͣḩ̠̲̱̝͍̫̮̝͙̬ͪͪ̉ͪ̒̌͒͛̆̓͆̊͒͐̈ͧ̀̿́ͨ̓̇̏̾̉̓̀͟͠͝ǵ̷̨̛͉͕̪̩̣̰͕̥͕̬̬̗̹̭̙̤̥͍͉̄̈́̽̒ͧͥ̆ͭ̌̄̃̈́̾͐͗̾ͦ͗̉̑̕͘ͅh̸̷̶͙͔̠̙̿̽̀̕͟ş̵̷̠̝̱͇͙̑́͒̃̃͐͆ͨ͋̓͛̍̓̿ͬ̌ͮ̎̐̕͡u̢͎̺̱̹͉̼̘͙̫͙̎ͮ̓̔͌̃ͧ͂ͫ̓ͨ̀͒͑̀͡͞͝ͅe̴̷͇̭̫̺̝͍͙͈̟̭̅͛̾̋ͦ̀̃̑ͨ̀̌ͬ̈́͌ͪ̿̚͢͜͜͡͝͡͠ ǵ̶̨̮̮̰̭̲̩̓̊̔͊̚̚͞ỉ̳̝̻̜̈́͆̒͊͂͜͡i̎u̵̷̶̢̧̧̨̲̞̪̬̫̻͍͍͇̳̖̥̾͐̈́̿ͬ̈́́̔̀͆ͮ̀̏̂̅̄͆͂̐̇̕̚̚͘̚͟͢s̴̨̨̹̬̥͚̳̬͖͔͎̖̜ͥ̾ͫ̆͌̓̀ͥͤ̽̓͐̿̀̕͡͡g̴̡͎̝͍͉͍̬̰̾̾̇̈͌ͪ̎̂͂͟e̵̸̷̢͍̞͍̹̜̫͉̰̝̤͓͈̅͌ͩ̆ͯ̋̎̆̋͑̋͗̆̉̆͒͗̑̚͡h̢͖̮̠̿̔́̊ͣ͘͝u̷̵̸̡͇̥͈͍̠͕͑̊̑ͪ̒ͩ̆̈́̽̅ͨͣ͟g̵̨̝̖̝̭̠͉̖͉̥͓͍̤̜̝̼͉̼ͬ̀ͪ͆̀̏ͫ̌ͨ̏ͯ̊͆͘͜͠s̷̴̴̵̵̷̷̡̡̯̜̹͕̟̭̬̲̖̥̗̞̠̞͒̇͑ͭ̾̽̈́̒͋͋ͫͬ̈͒ͩ̔͘͘͘͢ͅg͌h̴̢̡̯͍̜̮͓͔̺̬͎̬̹͇͍͇̻̒̿ͨͧ̑͌͋̋̐̏ͪͮͤ̅ͪ́ͯͅͅư̵̢̦̠̰̤̹̰͉̣̠̬̟͍̺͚͔͕͕͑ͯ͑̓ͪͬ̈̉͛̒̾̊̀̓̅ͦ̔͘͟ͅf̸͔̙̝̼͔͖͔͉̗̣̬̙̿͛ͬͧ̍͌ͧͧ͋ͮ̂͆ͩͣ͒͑̀͡i̞͉̍̌ͦͪ̀̓̓̚͢_̸̫̯͂̊̒ͯͩ_̢͉̻̘̗̭̳͎̥͎͗ͫͩ̾͌̏͒ͧ̈͠ų̵̷̛͔͕̠̤̫̫̗̞̹͙̞̩̖̯͔̀͗͋͐̈́̏̀͊̇ͨ̀̄̋ͨͯͨ́̚̕f̸̤̪͓̦̼̘̞̻͖̤͇̩̣̏͌ͮͫ̔̽ͫ̅ͦ͛ͨͤͪͩ̆ͩ̃̚͘͢ͅ3̖̰̙ͯͥ̿͞4̣̘̆ͪ͝g͙̜̻͐ͬ͊̏̑̐̓f̴̧̨̧̪̲̓ͫͧ̆̀́͛̄̃̀̽̃͆͐̉̓͝͞͡ 3̶̡̡̛̘̤͖̖̼̹͇̘͙̰̤̥ͣ͋͑̿̇̓̌̔ͪ́ͥ̍ͪ̏ͪ̚̕̚͞ͅ4̸̡̢̛̠̲̩̫͖̳͍̰̰̦͔͎̥̍ͧ͗͂̆͌͌̃̚̕͝ͅt̼̬͚͈̼̣̘ͭ͒̆̇̌̉ͣͥ͢d̸̷̳̗̃̈̎ͭ̕͜͢_̧͓͚͙̤͈͖͉͍̫͚͎ͩ̐̇̌ͫ̌ͥ́̀̒ͮ̈̒̑͂̍̎̃̚͡͠ș̴̶̛̰̥͍͍͙͈͈̜̘̭̙̭ͩ̈̓̉ͩͯ̆̾̏ͭ͆̄͗̀͊ͨ̾ͦ̐̉̚͜͢͞͠͝͡ǵ̸̴͕̱ͩͨsͧǧ̷̢̨͉̫̰̠̝̻̰̣̤̅ͭ̽̍͐̾͋͛̃̏͐͒ͫ̕͟͜͝͞͡͡ͅͅḑ̷̡̛͈̲̹̇̉̉ͮͫ͒̀̋͐ͣͣ̒̂ͯ͟g͈ͮ̿̔̉̉ u̯̻̯̭̥͕͕̜̺̒̔́ͭ̿h̴̛͓̬̳͓̓̐̆ͦ́̏̋͂̄ͧͪͨ̒̽̃̑͐ͅg̷̡̧̧̬̲̟̫̹̻̗̘͓̐͆͐̽̎ͧ̀͂̔̒͘͘͠_̮̰͖̯̿̄̊ͧ̎ͦu̴̻̹̥͑̉ͪ̌́ė̸̢̖̯̥̻̙̜̤̥͓̼̖̗̦͉̝̟͇͔̀̿ͮͦͧ̉͛ͬ̓̈̐͋̄ͦ͘͜͞͝s͛ḧ̟̭͚͌̐ṷ̷̡̡̧̨̬̟̲̦̞̺̣̺ͬͯ̍̂̃̓ͨ́̽ͪ̑̽̒ͫ̀͘̚͢͢e̴̷͈̹̦͇̗̝͍͚͕͕̒̌̆̒̒̃ͬ̈ͧ̂͒ͦ͗̃ͮͥ͂ͮͪ̃ͪ̓̕͠͞͝͝ŭ̵̶͙̖̯ͩ̊ͩh̨̨͔̖̖̥͈̠͉̲͔̹̺̲́̐̒̏ͫ̓̿͊̈́̀͆ͩͭ͆̀́͆̀ͬ͟͠ų̸̵̧̜̮̗̦̫̣̹͉̒̓̃̿́ͣ̌̓͐̅ͤ́ͮ͆̔͑̑͋̑͝͝͡ḩ̡͍͍͖̫̖̝̺͈͙̙̹͕̜̺̠͔͉̣̪̿̂̔͛͑̒ͨ̎̄̃̀̂̾ͣ͋͒͐̅̂̀̊͛ͦ͘u̴͖͎̬̙̲̜̠͉̭̠̤̲̇ͭ͌͌ͩ͆̇͡ͅ_̢̲͓̤̳̤̈́̅ͧ̅̾́̌ͫ̀̿́͋̍̒͜͞ͅȟ̢̡̛̖͉͓͈̼͖͉̹̹̗͈̣̦ͨͨͯ̿̈́ͭ̋̋͗̓̅͊̄̄̾͢͠͠ͅͅg͋f̸͖͖̰̙̜̺͓͖̃̿̽̀ͤ͘̕͢͡͠͝h̸̡̬̱͓̥̬̱̺̃̓̇͒̔u̶̧̧͇̫̠͚̺͍̓ͧ̆͗̀̊̏ͫ̑̅͋̑͌͒͟_̨̠͉̹̭̿͋̾ͣ̃͡ͅš̛͔̼͍̖̋͛͘̕͝͠͝d̸̨̫̪͒̾̋̚_̔u̴͍̲͍ͫ̆͆ͯ͢_̼̱̻͉_̨̮̰̠͇̰̰̼̆̅ͭ̓͗͂͆ͦ͆ͭ̅̕̚͝ģ̵̡̛̛̞̺̠̮̤̮͙̱͓̂͗̉͐ͮ̑̄͌͌ͨ̿͊ͧ̿̐̿̏̚͜͢͡ḩ̢̛̯̟͚̥̘̝̦͚̱̘̞̮̲̜̽͋ͭ̋̓͗ͭͯ̑ͤ̍̽͂ͦ̚s̷̴̢̨̨̧̛̥̙͉͎̼̭̠̠͓̥̥̈́͐͗̈̓̐́ͮ̕͜͢_̯͈̾ͬ͛͆ͮ͐g̢͉̯͇̝̳̱̼̚_̸̥̤́̄̏ḩ̴̸̷̨͖͙͍̻͉̟̜̞͕̣̬̰̬̯ͬͩ̊̈́̉̔̒ͬ͊̆̅̓̆̀͠e̥̫̬̹̯͛ͬ̏_̷̷̸̵̧̡̨̛̯̥̝͎ͥ͐ͭ̅̿͗̈̊ͬ̓͑͆ͤ̂ͭ̕͘͟͢͜͜ş̵̴͙̙̖̱̩̹̞̗̱̼̬͇̩̣̦̻̊͋͋ͯ̽̀ͬ̋͌̄͒͊̄́͘̚̚͢͞h̜ų̴̧̖͈̜̲͕̫̰͈͉̼̝͚̣̽͌̆͗̀ͥ̒͊͌̆̈́͌̄̓̿͂̄͘͘̕͟͟ų̴̴̛̛̘͍̫̹͕̼͖̻̰̬̪̥̦ͯͯ̍̐ͩͪ͊͂ͧ̅ͪ̓ͫ̀͂̃ͤ̈́̈̉͝͝͞_ͪ̌g̵̶̵̵̗̖̣̲̼̮̘̠͓͕̣̘̔͋ͥ̾́̋͛ͣ͂̒͐̀̾͘̚͜͟͟i̯͔̲̋̃̓̀͒ͅ_̶̢̲̺̙̠͍͚̟̀̿̿́̔͐́̄̓͆ͪ̂̒̿͢͟͡e̶̶̢̢̬̰͚̮͙͕̗͐̎͊͒ͣ̇̉̓̏ͫ̅͒̈̂̂͐̿̚͠ͅ_̱̫́̌ͦͨ̐͢͝ǐ̵̼̖̰̳̣̮̹͂͊ͪ̏̆͋ͨ̔ͬ̒͆͟͝ư̼̥͇ͭͭ̀͐̈́̍ͦͣ̽̒ḓ̷̴̠̲̟ͮͯͦͦͧ̊ͯͬ́ͥ̏͗͐̚s̷̛̤͍̰̥̹̰͍̲͇̪͙͕̲̖̀̍ͨ̽ͨ̎ͦ̇ͥ̔ͨ̇͑ͩ̊́̈́ͮͣ͊̏͗̇͢iͩ̋͜_̠͎̳̦̰̥̣̰̘̒͐͋̽̄͐ͪ̒̓́̕ͅͅ_̳̬ͮ̅͊̍ǔ̶̱̦̜͇̣̲͌ͭ͋̎ͅ_̖̰̭̪̙͚̩̜̇̄̽̇ͨͩ̀̍͞h͚̹̒͊̐̀̓ͧͫhu̧̳̬̪̜̬͉͖̦ͣͯ̅̒̚͟͝g̶̵̴̢̨̤̳̬̭̟̥̘̭͇̘̤͗̒͗ͣͭ́̒̂̌ͅí̵̡̻̼̬̮͎̗͈̯̟̠̱̜̇̔̃ͤͮ͗͐̇̉ͩ͊̑̍̀̕͟ư̷̴̡̗̻̞̖̲͙̞̳͐̆̀̈́ͫ̈̆̑̀́ͨ̊̚͘͢͡ȩ̨͔̭̹̪͍̳̭̫͉̲͙̫͈̱͉̖͕͓̅̎ͮͥͦͯ͊ͫ̽ͥͤ͐̍̓͆̎̄ͤ͘͢͢͝͡ͅͅs̨̧̛̪͔̗̈ͦ͗͊ͣḩ̠̲̱̝͍̫̮̝͙̬ͪͪ̉ͪ̒̌͒͛̆̓͆̊͒͐̈ͧ̀̿́ͨ̓̇̏̾̉̓̀͟͠͝ǵ̷̨̛͉͕̪̩̣̰͕̥͕̬̬̗̹̭̙̤̥͍͉̄̈́̽̒ͧͥ̆ͭ̌̄̃̈́̾͐͗̾ͦ͗̉̑̕͘ͅh̸̷̶͙͔̠̙̿̽̀̕͟ş̵̷̠̝̱͇͙̑́͒̃̃͐͆ͨ͋̓͛̍̓̿ͬ̌ͮ̎̐̕͡u̢͎̺̱̹͉̼̘͙̫͙̎ͮ̓̔͌̃ͧ͂ͫ̓ͨ̀͒͑̀͡͞͝ͅe̴̷͇̭̫̺̝͍͙͈̟̭̅͛̾̋ͦ̀̃̑ͨ̀̌ͬ̈́͌ͪ̿̚͢͜͜͡͝͡͠ ǵ̶̨̮̮̰̭̲̩̓̊̔͊̚̚͞ỉ̳̝̻̜̈́͆̒͊͂͜͡i̎u̵̷̶̢̧̧̨̲̞̪̬̫̻͍͍͇̳̖̥̾͐̈́̿ͬ̈́́̔̀͆ͮ̀̏̂̅̄͆͂̐̇̕̚̚͘̚͟͢s̴̨̨̹̬̥͚̳̬͖͔͎̖̜ͥ̾ͫ̆͌̓̀ͥͤ̽̓͐̿̀̕͡͡g̴̡͎̝͍͉͍̬̰̾̾̇̈͌ͪ̎̂͂͟e̵̸̷̢͍̞͍̹̜̫͉̰̝̤͓͈̅͌ͩ̆ͯ̋̎̆̋͑̋͗̆̉̆͒͗̑̚͡h̢͖̮̠̿̔́̊ͣ͘͝u̷̵̸̡͇̥͈͍̠͕͑̊̑ͪ̒ͩ̆̈́̽̅ͨͣ͟g̵̨̝̖̝̭̠͉̖͉̥͓͍̤̜̝̼͉̼ͬ̀ͪ͆̀̏ͫ̌ͨ̏ͯ̊͆͘͜͠s̷̴̴̵̵̷̷̡̡̯̜̹͕̟̭̬̲̖̥̗̞̠̞͒̇͑ͭ̾̽̈́̒͋͋ͫͬ̈͒ͩ̔͘͘͘͢ͅg͌h̴̢̡̯͍̜̮͓͔̺̬͎̬̹͇͍͇̻̒̿ͨͧ̑͌͋̋̐̏ͪͮͤ̅ͪ́ͯͅͅư̵̢̦̠̰̤̹̰͉̣̠̬̟͍̺͚͔͕͕͑ͯ͑̓ͪͬ̈̉͛̒̾̊̀̓̅ͦ̔͘͟ͅf̸͔̙̝̼͔͖͔͉̗̣̬̙̿͛ͬͧ̍͌ͧͧ͋ͮ̂͆ͩͣ͒͑̀͡i̞͉̍̌ͦͪ̀̓̓̚͢_̸̫̯͂̊̒ͯͩ_̢͉̻̘̗̭̳͎̥͎͗ͫͩ̾͌̏͒ͧ̈͠ų̵̷̛͔͕̠̤̫̫̗̞̹͙̞̩̖̯͔̀͗͋͐̈́̏̀͊̇ͨ̀̄̋ͨͯͨ́̚̕f̸̤̪͓̦̼̘̞̻͖̤͇̩̣̏͌ͮͫ̔̽ͫ̅ͦ͛ͨͤͪͩ̆ͩ̃̚͘͢ͅ3̖̰̙ͯͥ̿͞4̣̘̆ͪ͝g͙̜̻͐ͬ͊̏̑̐̓f̴̧̨̧̪̲̓ͫͧ̆̀́͛̄̃̀̽̃͆͐̉̓͝͞͡ 3̶̡̡̛̘̤͖̖̼̹͇̘͙̰̤̥ͣ͋͑̿̇̓̌̔ͪ́ͥ̍ͪ̏ͪ̚̕̚͞ͅ4̸̡̢̛̠̲̩̫͖̳͍̰̰̦͔͎̥̍ͧ͗͂̆͌͌̃̚̕͝ͅt̼̬͚͈̼̣̘ͭ͒̆̇̌̉ͣͥ͢d̸̷̳̗̃̈̎ͭ̕͜͢_̧͓͚͙̤͈͖͉͍̫͚͎ͩ̐̇̌ͫ̌ͥ́̀̒ͮ̈̒̑͂̍̎̃̚͡͠ș̴̶̛̰̥͍͍͙͈͈̜̘̭̙̭ͩ̈̓̉ͩͯ̆̾̏ͭ͆̄͗̀͊ͨ̾ͦ̐̉̚͜͢͞͠͝͡ǵ̸̴͕̱ͩͨsͧǧ̷̢̨͉̫̰̠̝̻̰̣̤̅ͭ̽̍͐̾͋͛̃̏͐͒ͫ̕͟͜͝͞͡͡ͅͅḑ̷̡̛͈̲̹̇̉̉ͮͫ͒̀̋͐ͣͣ̒̂ͯ͟g͈ͮ̿̔̉̉ s̵̷̡̘̩̦̣̣̗̭͎̉͒̑̽́͒͒ͬͮ͂͛̈͢͝͠͠b̶̧̙̠̥͕̝̣̤̳̦̤̎͛̂̂̑͆͑͂ͥ́ͭ̿̒̅̈́̉̿ͨg̷̪̙̥̣̰̩̫̘̩̺̳̤̻͕͔̫̬ͨ̓̂̃́̽ͧ̂̈̔̄̑̾ͤ̒͊͂̋̋h̤̝̋̔̽͛̎j̡̡̰̰̲̳͓̖̤̥̮̲̫̯̬̙͎̘ͯ̒̇̓̽ͧͧ̀̐ͤ͛̆̔ͫ̋̀̎ͤ͐̑͘͜͠͠w̧̨͇͓͎͙̰͇̤̮͊̌̓͌͐̀͘͜͢͠s̢͉ͨ͞e̱̻̥̍b̶̸̶̳̫̗̦͚̻̣͕̞̖̈́́ͫ̊ͪ͂̅̔͐ͧ͌͘̕͘͢͡͞͝ͅk̸̷̞̞̼̯̲̘̪̪͉͇ͭ̾ͫ͛͒͂ͤ́ͣ́̄̕̕ͅͅu͖̬͙̝̯͔͇̦̱ͪͬͤ̈_̛̪̋ͩͧģ̹̺̺͓͎̒̏̽̕_̸̮͓̼̯͂̅̂͝ų̸̢̯̗̠͈̙͈͔̜͙͕̹͙͔͙̊̀̅ͣ͛̊͑͗ͭ̐̓͆͘̕̚͜͢͠͡͠ͅṡ̇͘̕eḃ̴̷̢̥͓̹͚͓͖̤̬̭̪͈ͥͪ̄ͮ̿ͥͩͦ́͒ͩ̓̚͜͞ḡ͕͖̽ͣ_̴̶̸̷̢̛͙̬͉̝̘͔̳͔̯̔ͭ̀͒̽ͫ̀͑͛ͦ̋̑̑͆͠k̶̸̹͕̝̠͈͕̼͙̙̺̝̖̝͚͇̻͔̼͐͛ͫ̿̄ͨ̃͊̊ͦ̎͊̽͆̓͐̕͡ͅ_b̨̝̟d̛͋ͪs̨ͧg̴̢̧̖̪̬̮̩͕̻̭̰͉̯͔̱̐̆ͣ͑ͨͫ̐͘͘͟k̵̨̡̮͔̮̥͇͚̞ͩͫ͑̎̒͒̕͠ͅj̵̪̫̓_̷̴̶̖͙͕̜̥̺̮̼ͩͮͨ̿̓̓̏͜͢ư̷̸̮̬̂̄ͦ̀͝è̵̷̸̛̱̜͈͖̘̞̲̟͚͉̼̬̬̣̰̤͆͑͑̾͆̌̐̊̔̀̀̃ͩͤ̀̆͘̚͟͞͞͞͡ͅͅs̛̪̞̹͚̗̠͓̲̙ͩ̉ͣͫͤ̆ͪ̓̀ͦ̓̅̓ͪ̚͠d̷̛̲̭͔͚̻̭̠̰ͤ̇͌̐͒͘g̸̸̛̛̛͖̮̹͉̜̦͎͇̣̀̾ͪͮ̽̍͊̆͊́̑̌ͩ̈̏̅̚͜͟͠͝k̯̯̩̥̩̱͎̳̜̮͖̬̈́ͯ̌͒̋́̓ͩ̃̑͘̕͜j̷̨̨̼̺ͧ͗̀ͩ̃_̧͂ͣͥ́s̨̨̧̝͕̘͎̱̩̲̱͈͋̇̏̓̆ͮ̎͂ͬ̅ͣͣ́̄͞ͅ_̔͒̄̀ͯ͡ḍ̜̣̌̔̓_̷̣u̴̸̢̢̟̞̤̳͇̝̖̜̱͔̳͔̯̟ͦ͛͗̃̇̈ͧͦ̀͐ͫͣ̂̈͂͂̅̇̽̆͂ͧ̎̏͂̒̅͟͜g̨̧ͦͭ̓̒͋̌͆͟h̶̢̛̤̼̺͈͖̱̲̝̩̘̙̰̀͋̅̐ͩ̒́̅̽͛̉̍́́̂̏̒̿ͣ̕̕͟͟͜͢͝͝͞e̶̷̮̫̱̙͔̣͎̻ͦ̊̃͑͗͟͝_̧̢̣̪̟͈̦͑ͮ̌̄ͥͣ̑̕͡s̢̧̡̢̖͕͓̪͕̳̞̐ͬ̇͌̑͌ͨ̅̽̽͞ͅuh̵̴͙͓͚͎̣͚̫͉̟͖̜̒̐͌́̄̔̅ͫͮ̄̄̿ͬ͢͢͞ͅgͣ͢u̧̨̠̖̮̜͎̞͉̞̖̞̙̼͓̮͕̓͆͆̋ͮ͐͑ͣ̐͆̏ͦ̾̾̋ͩs̡̻̏̋̑̅̽ͦ̓͛̎̄̓͂ͤͨ̆̋̇͂̑̕̚͞_̶̛͍̠̭͕̝ͮͮ́̇ͬ̃͐̋ͪ̉ͨ̉̕͡ẖ̸̸̛̣̮̞̪̹͇͓̖͙̬̞͉ͪ̏ͤͬͧ́̅͛ͧͣͦ̐͆̀̎̎̊̍̈ͥ́̒͊̌̄̚͜͢͞͠͠ũ͓̼̰̑͢͝_̸̷̬̲̖̮̝͍̲͔̥͙̯̌̆́͑̈́ͭ̈͂̎ͤͭ̉̂͋̅̚͟͡͞ē̛͔̗̩͚̝͙͙̩ͩ̍̈́ṷ̴̡̢̨̝͈͔̫̠̭̙́̔̄̅̂ͫ̚͞_̸̨̫͚̤̣̮̎͌͌̑̉̀̾͋͡ḧ̴́g͔̞͊̂̑͐ͯ̆̎͢͢kj̵̷̧̢̡̭̠̠̜̩̝̖̬͚̟̼̙̫̬͖͖͍̳͈̉̂ͬͥ͌̈ͧͧ̋̿ͬ̔̍͌̀̈̈̉͑̌̚̚n̷͇̤̘͔̣̘̫͚̝̪̑̆ͫͧ͌̂ͮ̚dsu͔ͬ_̢͕̭̌̃_̸̸̵̠̫͉͖͉̣̹̝̞͚͚̹͙̑̀̀͊̃ͧ͗͋́ͬ͘͠ͅȏ̶̶̢̡̖̙̱̺͉̐͂ͯ͑̓ͯ̾͆͜_̶̳̗̬̳͙͑̽̕ư̶̧̭̠̳̖̮̯ͪ̾̎͆̿̎̀͘̚̚͡t̷̨̡̛͖͓̘̯͓̥̗̰̞̼̫̭̮̟̫̱͎̾̏̓̃͂̆̈ͧ̅̋͒̒́ͤ͂́̕͟͢ͅg̛ņ̢̡̳̥͐͑ͯ̂̀̚͜͝͞͞͞ę̸̷̵̴̢͉͖̥̟̱̯͉̱̬͉̠̎̽ͪ̓͗ͬ̈́̊̓̉͗̌ͮ̓̚̕͟͜͢͠s̡̉̓̉b̡̮̲̟̲̫̼͖̥̥͇̯̣ͤ̓̊ͮ̃͛́ͯ̔ͣͯͩͮ̾̑ͬ͟g̡̡͙̪̣̬̮͉̯̩̻̖̪̻̻͖̱̈̅͌̇͌̅ͪ͛̈́̏ͩ̌ͧ͠͡ͅḓ̸̷̡̜̟̟͚͙̖̥͇̦̯̩͕̗̙̬̤̩̆ͬ̔̎ͦͨ̀͛ͧ̇̊͌̆ͤ̍̆͌ͬ̏ͦ͟͠͝b̧̡͙̞̯̙̩̙̆̔̇ͪͧ̋ͥ͂͐͝͡s̡̺̤̠͆́̐ͨ̉̐́͝z̴̶̸̴̷̧̧͓͕̲̭͈̝͖̖̘̳͖͗ͤ̿ͭ́̌̄̌̓̿̏̆͑ͭͫ͐̊̓ͬͧ̈́̀̀̕͝͝x̴̴̴̡̨͔̱͎̫͇͍͇̊ͣͬ̃́͆̅̋ͭ̅̀ͭ̈̃ͪ̊̐͗̕͘ͅi̘̒ͧ̅u̡̨̡̱͙͓̟͖̤͍̯̫̼͍̜̪̦̬ͤͪ̋͒̇ͯͨ͛ͩ̒͒̎ͯ̈́ͩ͗͂̀͗͂̆͘͞͝͞͠v̢̪͒̑̆̄̄̒̇s̶̡̧̧͈̜̹̫̮͔̗̩̙̭̼͓͚̮̰͖̪ͣ̆̇̊̃̈ͦ̓͆ͪ̐́̍̾̑͒ͬ̒̋͊ͣ́̌͢͢͞u̝̳̲ͮͨg̴̪͓̼͖̖̫͆͂̌ͬ͗̉̀̈́̅̚̚̕h̸̵̜̬̩̊̆ͫͭͨ̓́̌h̶̢̪̮̱̫ͭ̅ͨ̑̚ư̵̵͇̲̬̥̙ͥ̐̂ͪͧ͒͐̕͟͢ë̶̺̪̘̖́̄ͣ̇̏ͭ̂͘̚͡s̶̳̦̙̥͋͗̈́͂ͪhg̫͇ s͙ͨ͊e̢̘̖̘̠͉ͪ̈̓̍ͅğ̶̶̬͓̯̤͇̙̮̮̲̀̂̽ͨ̍̋ͮͬͫ̓̿̽̂͜͢͞͠͝ u͓̪̝̺̞̲̗͋ͨ̇̏ͫ̊ͧ̒͑̍̋͐͞ͅę̴̷̧̢̧͓̞̪̱͍̱̥ͪͨ͗ͤ́ͬͣͫ͢s͙̣̪̩͙̹͙̜̤ͩ͐̄̂͐́̉̂̀̄͘͞ͅų̷̵̡̧̛̤̦̟̼̗̩̤̯̩̬̟̘̻̰̘̻͉̼̻̺͚̒ͧ͆ͦ͛ͫ̓ͯ̒̓̽̔ͥ̉ͤ̀̓͠ͅ ģ̶̸̴̛̥̫̺̳͔̪̞̣̥̔̎ͦ͌̅̀ͮ̓ͥͩ̄ͬ͛̉͜͝ͅh̦̺̯̟̤̥̬̱͇ͯ̾͛ͣͯ̎ͧͥ̊͘͢s̵̢̳̮̱̯̟̹̤̆̎̾ͮ͑ͦ͗̄̾͒͒̚͢d̷̸̢̠͖͍̹̘͇̙̤͍͈͓͓̮̮̣͕̺̰͉̠̙ͮ͑̀ͬ̍͐̅ͮ̂͌̓͑ͫ͐̂̔̏̃ͯ̕ͅh̵̨̨̡̛̩̪̩͚̥̙̪̤̭ͨͫ́̎ͧ̈̀ͯ̾͆͗̋̓̆͘̕͝͞ͅ_̡͈̣̇͒͆̒ģ̴̷̨̨̪̩̤̫͔̙̺̺͇͇̤̹͉ͧ́ͬ̈́́ͭͩ͑̍̐̃ͣ̚͠ͅͅh̶̭̤̯̠́̾͐̇͑b͉̯̥̱̬̯̝̏ͩ͒̍̌̅̾ͮͫ͊͌͋͑͂͝s̨̜̣͉̤̹̗͛̊̋ͦ̉͟͠͠ḏ̵̴̖̗̻̙̲̥̹̱͑͆̿̈̈́̽̃̊͗̌̐͆ͭ́ͪ̆͋ͅb̸̶̡̡͕̘̹͈͔͙̝͉͙̝͙̰̦̪͛͆ͫ͐̏͑̒ͯ̀̅͜͢ ỉ̷͍̟͎͖̄ͦ͌̀̑̀͡͝b̶̢͉͇̠̣͆ͣ̓̃͊͟ͅǧ̢̨͕̰̮̲̹̲̣̪̻͈̖ͥ̈́ͭ͒͆̅̒ͪ͂̽̈́͗͘͞͠f͙̯̝̪͔̮̩̺̘̣͇ͨͪ́ͧͤ͒͊͆̈́ͫ̊ͦͯ̆͗͜͠hͣ̇ͣ ę̧̧̨̪̦̘̯̦̺̣̩ͤ̾ͫͯ̈ͪ͂̽͝͞s͕̲̔͝ u̯̻̯̭̥͕͕̜̺̒̔́ͭ̿h̴̛͓̬̳͓̓̐̆ͦ́̏̋͂̄ͧͪͨ̒̽̃̑͐ͅg̷̡̧̧̬̲̟̫̹̻̗̘͓̐͆͐̽̎ͧ̀͂̔̒͘͘͠_̮̰͖̯̿̄̊ͧ̎ͦu̴̻̹̥͑̉ͪ̌́ė̸̢̖̯̥̻̙̜̤̥͓̼̖̗̦͉̝̟͇͔̀̿ͮͦͧ̉͛ͬ̓̈̐͋̄ͦ͘͜͞͝s͛ḧ̟̭͚͌̐ṷ̷̡̡̧̨̬̟̲̦̞̺̣̺ͬͯ̍̂̃̓ͨ́̽ͪ̑̽̒ͫ̀͘̚͢͢e̴̷͈̹̦͇̗̝͍͚͕͕̒̌̆̒̒̃ͬ̈ͧ̂͒ͦ͗̃ͮͥ͂ͮͪ̃ͪ̓̕͠͞͝͝ŭ̵̶͙̖̯ͩ̊ͩh̨̨͔̖̖̥͈̠͉̲͔̹̺̲́̐̒̏ͫ̓̿͊̈́̀͆ͩͭ͆̀́͆̀ͬ͟͠ų̸̵̧̜̮̗̦̫̣̹͉̒̓̃̿́ͣ̌̓͐̅ͤ́ͮ͆̔͑̑͋̑͝͝͡ḩ̡͍͍͖̫̖̝̺͈͙̙̹͕̜̺̠͔͉̣̪̿̂̔͛͑̒ͨ̎̄̃̀̂̾ͣ͋͒͐̅̂̀̊͛ͦ͘u̴͖͎̬̙̲̜̠͉̭̠̤̲̇ͭ͌͌ͩ͆̇͡ͅ_̢̲͓̤̳̤̈́̅ͧ̅̾́̌ͫ̀̿́͋̍̒͜͞ͅȟ̢̡̛̖͉͓͈̼͖͉̹̹̗͈̣̦ͨͨͯ̿̈́ͭ̋̋͗̓̅͊̄̄̾͢͠͠ͅͅg͋f̸͖͖̰̙̜̺͓͖̃̿̽̀ͤ͘̕͢͡͠͝h̸̡̬̱͓̥̬̱̺̃̓̇͒̔u̶̧̧͇̫̠͚̺͍̓ͧ̆͗̀̊̏ͫ̑̅͋̑͌͒͟_̨̠͉̹̭̿͋̾ͣ̃͡ͅš̛͔̼͍̖̋͛͘̕͝͠͝d̸̨̫̪͒̾̋̚_̔u̴͍̲͍ͫ̆͆ͯ͢_̼̱̻͉_̨̮̰̠͇̰̰̼̆̅ͭ̓͗͂͆ͦ͆ͭ̅̕̚͝ģ̵̡̛̛̞̺̠̮̤̮͙̱͓̂͗̉͐ͮ̑̄͌͌ͨ̿͊ͧ̿̐̿̏̚͜͢͡ḩ̢̛̯̟͚̥̘̝̦͚̱̘̞̮̲̜̽͋ͭ̋̓͗ͭͯ̑ͤ̍̽͂ͦ̚s̷̴̢̨̨̧̛̥̙͉͎̼̭̠̠͓̥̥̈́͐͗̈̓̐́ͮ̕͜͢_̯͈̾ͬ͛͆ͮ͐g̢͉̯͇̝̳̱̼̚_̸̥̤́̄̏ḩ̴̸̷̨͖͙͍̻͉̟̜̞͕̣̬̰̬̯ͬͩ̊̈́̉̔̒ͬ͊̆̅̓̆̀͠e̥̫̬̹̯͛ͬ̏_̷̷̸̵̧̡̨̛̯̥̝͎ͥ͐ͭ̅̿͗̈̊ͬ̓͑͆ͤ̂ͭ̕͘͟͢͜͜ş̵̴͙̙̖̱̩̹̞̗̱̼̬͇̩̣̦̻̊͋͋ͯ̽̀ͬ̋͌̄͒͊̄́͘̚̚͢͞h̜ų̴̧̖͈̜̲͕̫̰͈͉̼̝͚̣̽͌̆͗̀ͥ̒͊͌̆̈́͌̄̓̿͂̄͘͘̕͟͟ų̴̴̛̛̘͍̫̹͕̼͖̻̰̬̪̥̦ͯͯ̍̐ͩͪ͊͂ͧ̅ͪ̓ͫ̀͂̃ͤ̈́̈̉͝͝͞_ͪ̌g̵̶̵̵̗̖̣̲̼̮̘̠͓͕̣̘̔͋ͥ̾́̋͛ͣ͂̒͐̀̾͘̚͜͟͟i̯͔̲̋̃̓̀͒ͅ_̶̢̲̺̙̠͍͚̟̀̿̿́̔͐́̄̓͆ͪ̂̒̿͢͟͡e̶̶̢̢̬̰͚̮͙͕̗͐̎͊͒ͣ̇̉̓̏ͫ̅͒̈̂̂͐̿̚͠ͅ_̱̫́̌ͦͨ̐͢͝ǐ̵̼̖̰̳̣̮̹͂͊ͪ̏̆͋ͨ̔ͬ̒͆͟͝ư̼̥͇ͭͭ̀͐̈́̍ͦͣ̽̒ḓ̷̴̠̲̟ͮͯͦͦͧ̊ͯͬ́ͥ̏͗͐̚s̷̛̤͍̰̥̹̰͍̲͇̪͙͕̲̖̀̍ͨ̽ͨ̎ͦ̇ͥ̔ͨ̇͑ͩ̊́̈́ͮͣ͊̏͗̇͢iͩ̋͜_̠͎̳̦̰̥̣̰̘̒͐͋̽̄͐ͪ̒̓́̕ͅͅ_̳̬ͮ̅͊̍ǔ̶̱̦̜͇̣̲͌ͭ͋̎ͅ_̖̰̭̪̙͚̩̜̇̄̽̇ͨͩ̀̍͞h͚̹̒͊̐̀̓ͧͫhu̧̳̬̪̜̬͉͖̦ͣͯ̅̒̚͟͝g̶̵̴̢̨̤̳̬̭̟̥̘̭͇̘̤͗̒͗ͣͭ́̒̂̌ͅí̵̡̻̼̬̮͎̗͈̯̟̠̱̜̇̔̃ͤͮ͗͐̇̉ͩ͊̑̍̀̕͟ư̷̴̡̗̻̞̖̲͙̞̳͐̆̀̈́ͫ̈̆̑̀́ͨ̊̚͘͢͡ȩ̨͔̭̹̪͍̳̭̫͉̲͙̫͈̱͉̖͕͓̅̎ͮͥͦͯ͊ͫ̽ͥͤ͐̍̓͆̎̄ͤ͘͢͢͝͡ͅͅs̨̧̛̪͔̗̈ͦ͗͊ͣḩ̠̲̱̝͍̫̮̝͙̬ͪͪ̉ͪ̒̌͒͛̆̓͆̊͒͐̈ͧ̀̿́ͨ̓̇̏̾̉̓̀͟͠͝ǵ̷̨̛͉͕̪̩̣̰͕̥͕̬̬̗̹̭̙̤̥͍͉̄̈́̽̒ͧͥ̆ͭ̌̄̃̈́̾͐͗̾ͦ͗̉̑̕͘ͅh̸̷̶͙͔̠̙̿̽̀̕͟ş̵̷̠̝̱͇͙̑́͒̃̃͐͆ͨ͋̓͛̍̓̿ͬ̌ͮ̎̐̕͡u̢͎̺̱̹͉̼̘͙̫͙̎ͮ̓̔͌̃ͧ͂ͫ̓ͨ̀͒͑̀͡͞͝ͅe̴̷͇̭̫̺̝͍͙͈̟̭̅͛̾̋ͦ̀̃̑ͨ̀̌ͬ̈́͌ͪ̿̚͢͜͜͡͝͡͠ ǵ̶̨̮̮̰̭̲̩̓̊̔͊̚̚͞ỉ̳̝̻̜̈́͆̒͊͂͜͡i̎u̵̷̶̢̧̧̨̲̞̪̬̫̻͍͍͇̳̖̥̾͐̈́̿ͬ̈́́̔̀͆ͮ̀̏̂̅̄͆͂̐̇̕̚̚͘̚͟͢s̴̨̨̹̬̥͚̳̬͖͔͎̖̜ͥ̾ͫ̆͌̓̀ͥͤ̽̓͐̿̀̕͡͡g̴̡͎̝͍͉͍̬̰̾̾̇̈͌ͪ̎̂͂͟e̵̸̷̢͍̞͍̹̜̫͉̰̝̤͓͈̅͌ͩ̆ͯ̋̎̆̋͑̋͗̆̉̆͒͗̑̚͡h̢͖̮̠̿̔́̊ͣ͘͝u̷̵̸̡͇̥͈͍̠͕͑̊̑ͪ̒ͩ̆̈́̽̅ͨͣ͟g̵̨̝̖̝̭̠͉̖͉̥͓͍̤̜̝̼͉̼ͬ̀ͪ͆̀̏ͫ̌ͨ̏ͯ̊͆͘͜͠s̷̴̴̵̵̷̷̡̡̯̜̹͕̟̭̬̲̖̥̗̞̠̞͒̇͑ͭ̾̽̈́̒͋͋ͫͬ̈͒ͩ̔͘͘͘͢ͅg͌h̴̢̡̯͍̜̮͓͔̺̬͎̬̹͇͍͇̻̒̿ͨͧ̑͌͋̋̐̏ͪͮͤ̅ͪ́ͯͅͅư̵̢̦̠̰̤̹̰͉̣̠̬̟͍̺͚͔͕͕͑ͯ͑̓ͪͬ̈̉͛̒̾̊̀̓̅ͦ̔͘͟ͅf̸͔̙̝̼͔͖͔͉̗̣̬̙̿͛ͬͧ̍͌ͧͧ͋ͮ̂͆ͩͣ͒͑̀͡i̞͉̍̌ͦͪ̀̓̓̚͢_̸̫̯͂̊̒ͯͩ_̢͉̻̘̗̭̳͎̥͎͗ͫͩ̾͌̏͒ͧ̈͠ų̵̷̛͔͕̠̤̫̫̗̞̹͙̞̩̖̯͔̀͗͋͐̈́̏̀͊̇ͨ̀̄̋ͨͯͨ́̚̕f̸̤̪͓̦̼̘̞̻͖̤͇̩̣̏͌ͮͫ̔̽ͫ̅ͦ͛ͨͤͪͩ̆ͩ̃̚͘͢ͅ3̖̰̙ͯͥ̿͞4̣̘̆ͪ͝g͙̜̻͐ͬ͊̏̑̐̓f̴̧̨̧̪̲̓ͫͧ̆̀́͛̄̃̀̽̃͆͐̉̓͝͞͡ 3̶̡̡̛̘̤͖̖̼̹͇̘͙̰̤̥ͣ͋͑̿̇̓̌̔ͪ́ͥ̍ͪ̏ͪ̚̕̚͞ͅ4̸̡̢̛̠̲̩̫͖̳͍̰̰̦͔͎̥̍ͧ͗͂̆͌͌̃̚̕͝ͅt̼̬͚͈̼̣̘ͭ͒̆̇̌̉ͣͥ͢d̸̷̳̗̃̈̎ͭ̕͜͢_̧͓͚͙̤͈͖͉͍̫͚͎ͩ̐̇̌ͫ̌ͥ́̀̒ͮ̈̒̑͂̍̎̃̚͡͠ș̴̶̛̰̥͍͍͙͈͈̜̘̭̙̭ͩ̈̓̉ͩͯ̆̾̏ͭ͆̄͗̀͊ͨ̾ͦ̐̉̚͜͢͞͠͝͡ǵ̸̴͕̱ͩͨsͧǧ̷̢̨͉̫̰̠̝̻̰̣̤̅ͭ̽̍͐̾͋͛̃̏͐͒ͫ̕͟͜͝͞͡͡ͅͅḑ̷̡̛͈̲̹̇̉̉ͮͫ͒̀̋͐ͣͣ̒̂ͯ͟g͈ͮ̿̔̉̉ 5͉̥͈̰̠͕͎̖̣ͭ͗̂͒̍̌͋͒͑̄̕͟͠͝ͅ4̷̢̧̛͓̰͇̗̬̬̱̩̹͎̼̘͐ͨ͌ͩ̀͐̌̃̓ͪͫ̆ͭͩ̏̒͌͂̕͜͢͝͡g̨͕̞̮̩̀̅̐̀ͦͤ͝͡_̸͖̟̰̼̿̓̀͆ẇ̶̧̢̱̪̤̤͇͈̰̗̜͑ͣ̎͋̄ͩͭ͊͜͢͠͠ͅs̡̯̻̟͕̍̀͒̿͐͛_̨͚͙̩̃͂͋̄͢ḑ̷̴̡̭̞͙̬̬̫̳̯̤̲̠̱̽̀͛ͤ̇̍̂̓̆̐͋͡͞gę͇̮͐̇̈́ͤ̚̕͠ŗ̷̵̙̻͓̘͉͎͈͖̈̀ͬ̇͌̄͂̌̐̽͜͠s̏s̩̺̯̺͚̒̈́s͈̠̻̜̩̤͙̳̍̐͒̔̒ş̶̡̤͙̥̥͔͇̭͍̤̘̬̖̱ͬ͊ͯ̂ͪ̆́̑͒̄̇̀͗̉̏ͧ̕͟͜͡͠͠ş̷̛̘̺̰ͥͩ͛͂̿͜ṣ̴̨̧̧̬̟̹͕̻͙̿͌̊ͤ͊s̷̡̛̪̰͉̯̞̱͔̖̈ͩ̓̎̃ͦ̈ͪ̓ͥ͌͠_̵̖̜̯̮̮̘͔͎͊̌ͫ̉̔ͬ̾̄̈́́͘͘͜ŝ̚s̸̛̱̟̓̍ͤ̈̂͜s̪̻͛̎̊͟ş̢̡̛͓̦͔͍̫̗͎͈̭͍͎̿̊͗ͤ̀̓̀̅ͨͪ͊̋ͥ̿̎͋̍͑̚͟͟͠ŝ̶̢̛̩̼̖̗̤̖̩̖̘̫͉̃ͦ̓̀͆̍̔͘͟ğ̖͉ͭͤ̃r̸̨͕͈̖͖ͥ́͛ͣ̏̆̋͗́͘_̡̢̧̬̻̺̖̊̎̅ͭͩ͆̽́͐̑̐͆ͨ͗ͨ̇ͨ͒̅͒͊r̶̢̯̹̙͎̬̟̗̝̈́̑̾̽͒̾̒ͤ̈́͢͝rͣ̿̂ͭ̑r̗̹ͮ̇̐͌͠r̸̤̺͓̲̝̟̊̓̀̑͘ͅr̨͈̬̜̙̭̝͙̖̝̬͋̔̿ͦ̈́̔͂͗̔̽͂ͧ͋̑͒̐ͣ͜r̡̡͎̠̹̟̜̲͇̳̥͔ͥ̓͊̔̄͂̂ͫͦͮ̚͠ͅr̶̛͍͉̤̟̖̝̹̣͖͓ͪ̐ͬ͐̿ͪ̓̀ͦ́̌̌ͮ̏͛́͢͜ͅr̟̱͙͔̥͊̐̀̎ͦ̂͢͡͡͠r̎ȓ̸̰̱̭͍̬̤̭̭̻̙̉ͩ́̐̍ͪ͊ͩ̅̈̕͝͡͝_̭̰̠̑͘͠s͛̈̑j̠̹̝́͡s̴̗̬͇̫̲̎̏ͮ̊͐ͫͮ͗́ͨ̅͑̾̊ͪ̈ͨͬ̀ͫ͘j̢̧̖͓̯̦͔̺̙̮͍̤͕͕̺͚̅͊̈́ͭͣ̉̍͑ͤ̐̂̀̈͐͌͊̐̀̀̈͘͞ͅf̞̠ͩ̒͌̇ͪ̾͡ͅb̸̵̸̶̸͉̤̘̘͙̺̻̗̼̠͓̪̂̽̐͗̉̓̽ͨ̕͢͜͢͟_̵̮̙̄̉̈̐̕ȩ̴̫̃͂̾̑̕j̸̷̸̶̶̵̜̱̣̬͕͉̮̘̪̰̪͙̼̐̏͛̏̈́́ͪ͊ͫͥ̐̔͆ͩͧͥͨ͌̑͂͘̚͜͝͠͞͠ͅḩ̷̞͕̺̻͔͙̳̫̩̥͙̜͇̂͑̊̎̓̿͐̐ͭ͆̿ͫ̒̒͒̄͋̚͢͝f̶̧̰̱̙̻͎̘̞̺̪͓͉ͥ͂̋ͥ͑̓̊͛͌ͦ͟͜͜ͅb̧̙̬̪̫̱̒͗̆͜n̵̵̜̹̱̣͖͇̘̞̮͈ͥ̽ͬ̅̏̿͗̑̑ͭ̈́ͥ͘̕͜_̡̻̝̙̎́̈́͜ds̷̶̸̷̖̙̝̬̘̟̗͍̗͉̬̹̻̰̮̹͍̖̄̀͊ͯ̂ͧ̐̿̓̎̅̍̽ͧ̒͑ͪ̈́͘̚͟͟͡͠͡b̴̢̢̛͍̯̫̼̐̌̎̓ͯ̋͘͜͞f̛̫̻͓̻̫̥̙̰̯̬̰͑͑̉̿͌̆͂ͪ͆̒̈́ͫͫ̽̀̆͟h̸̟̼͖͍͉͙̘̗̰̐͆ͬͯ̿ͭͭ̐̀j̷̵̡̛͎̮̙̦̝̰͖̅̈́͑̾̂̒ͥ̃ͪ̕̚͠_̵̸̷͍̻̭̞̥̊̌ͥͧ͒̍ͮ́ͣ̌͒̽͜͝s̱̗͚͇ͨ_̒b̴̧̜̜̥͕̲̘̬͓͕̭̽ͪ̋͒̐͑̂͑͑͑f̛̝̰̮̣͒̄̇̿͗̔̎̑̇͟͡h̬̰͚͉͑̑̎͑̒̂͗ͥ͡g̼̮͌̎ue̵̢̹̜͓̖͉̝͕̲͖̘̬̫̝ͫͧͩ̅̉̍ͨ̂̒́̇̈̍̀͆̌̏̚͟ͅs̵̶̛͈̣͈̰͇͈̗͔͓̫̬̞̰̹ͣ̇͋ͤͮͪ̄̆̀̈̉̎͋͛̎͗̀̚̚͜͜͞͝f́g̸̸̶̵̢̲͚̬̮̪̬͈̹̼̞ͪ͒͑ͣ̆̄̒͂̓̒͗̒͛̈͂̔ͧ̿̾ͮͭ̀̐́͑ͨ͆ͪ̕͠͞h̳̹̖͑ͯ̑̒̋̎̏ͭ͜͞d_̧͍̘͍̼̭̤̖̼̾͆͌́͌̋̿͂ͯ̉̇̑̓ͣ̾̇́̚̚͟͟͡s̵̷̡̘̩̦̣̣̗̭͎̉͒̑̽́͒͒ͬͮ͂͛̈͢͝͠͠b̶̧̙̠̥͕̝̣̤̳̦̤̎͛̂̂̑͆͑͂ͥ́ͭ̿̒̅̈́̉̿ͨg̷̪̙̥̣̰̩̫̘̩̺̳̤̻͕͔̫̬ͨ̓̂̃́̽ͧ̂̈̔̄̑̾ͤ̒͊͂̋̋h̤̝̋̔̽͛̎j̡̡̰̰̲̳͓̖̤̥̮̲̫̯̬̙͎̘ͯ̒̇̓̽ͧͧ̀̐ͤ͛̆̔ͫ̋̀̎ͤ͐̑͘͜͠͠w̧̨͇͓͎͙̰͇̤̮͊̌̓͌͐̀͘͜͢͠s̢͉ͨ͞e̱̻̥̍b̶̸̶̳̫̗̦͚̻̣͕̞̖̈́́ͫ̊ͪ͂̅̔͐ͧ͌͘̕͘͢͡͞͝ͅk̸̷̞̞̼̯̲̘̪̪͉͇ͭ̾ͫ͛͒͂ͤ́ͣ́̄̕̕ͅͅu͖̬͙̝̯͔͇̦̱ͪͬͤ̈_̛̪̋ͩͧģ̹̺̺͓͎̒̏̽̕_̸̮͓̼̯͂̅̂͝ų̸̢̯̗̠͈̙͈͔̜͙͕̹͙͔͙̊̀̅ͣ͛̊͑͗ͭ̐̓͆͘̕̚͜͢͠͡͠ͅṡ̇͘̕eḃ̴̷̢̥͓̹͚͓͖̤̬̭̪͈ͥͪ̄ͮ̿ͥͩͦ́͒ͩ̓̚͜͞ḡ͕͖̽ͣ_̴̶̸̷̢̛͙̬͉̝̘͔̳͔̯̔ͭ̀͒̽ͫ̀͑͛ͦ̋̑̑͆͠k̶̸̹͕̝̠͈͕̼͙̙̺̝̖̝͚͇̻͔̼͐͛ͫ̿̄ͨ̃͊̊ͦ̎͊̽͆̓͐̕͡ͅ_b̨̝̟d̛͋ͪs̨ͧg̴̢̧̖̪̬̮̩͕̻̭̰͉̯͔̱̐̆ͣ͑ͨͫ̐͘͘͟k̵̨̡̮͔̮̥͇͚̞ͩͫ͑̎̒͒̕͠ͅj̵̪̫̓_̷̴̶̖͙͕̜̥̺̮̼ͩͮͨ̿̓̓̏͜͢ư̷̸̮̬̂̄ͦ̀͝è̵̷̸̛̱̜͈͖̘̞̲̟͚͉̼̬̬̣̰̤͆͑͑̾͆̌̐̊̔̀̀̃ͩͤ̀̆͘̚͟͞͞͞͡ͅͅs̛̪̞̹͚̗̠͓̲̙ͩ̉ͣͫͤ̆ͪ̓̀ͦ̓̅̓ͪ̚͠d̷̛̲̭͔͚̻̭̠̰ͤ̇͌̐͒͘g̸̸̛̛̛͖̮̹͉̜̦͎͇̣̀̾ͪͮ̽̍͊̆͊́̑̌ͩ̈̏̅̚͜͟͠͝k̯̯̩̥̩̱͎̳̜̮͖̬̈́ͯ̌͒̋́̓ͩ̃̑͘̕͜j̷̨̨̼̺ͧ͗̀ͩ̃_̧͂ͣͥ́s̨̨̧̝͕̘͎̱̩̲̱͈͋̇̏̓̆ͮ̎͂ͬ̅ͣͣ́̄͞ͅ_̔͒̄̀ͯ͡h̢͖̮̠̿̔́̊ͣ͘͝u̷̵̸̡͇̥͈͍̠͕͑̊̑ͪ̒ͩ̆̈́̽̅ͨͣ͟g̵̨̝̖̝̭̠͉̖͉̥͓͍̤̜̝̼͉̼ͬ̀ͪ͆̀̏ͫ̌ͨ̏ͯ̊͆͘͜͠s̷̴̴̵̵̷̷̡̡̯̜̹͕̟̭̬̲̖̥̗̞̠̞͒̇͑ͭ̾̽̈́̒͋͋ͫͬ̈͒ͩ̔͘͘͘͢ͅg͌h̴̢̡̯͍̜̮͓͔̺̬͎̬̹͇͍͇̻̒̿ͨͧ̑͌͋̋̐̏ͪͮͤ̅ͪ́ͯͅͅư̵̢̦̠̰̤̹̰͉̣̠̬̟͍̺͚͔͕͕͑ͯ͑̓ͪͬ̈̉͛̒̾̊̀̓̅ͦ̔͘͟ͅf̸͔̙̝̼͔͖͔͉̗̣̬̙̿͛ͬͧ̍͌ͧͧ͋ͮ̂͆ͩͣ͒͑̀͡i̞͉̍̌ͦͪ̀̓̓̚͢_̸̫̯͂̊̒ͯͩ_̢͉̻̘̗̭̳͎̥͎͗ͫͩ̾͌̏͒ͧ̈͠ų̵̷̛͔͕̠̤̫̫̗̞̹͙̞̩̖̯͔̀͗͋͐̈́̏̀͊̇ͨ̀̄̋ͨͯͨ́̚̕f̸̤̪͓̦̼̘̞̻͖̤͇̩̣̏͌ͮͫ̔̽ͫ̅ͦ͛ͨͤͪͩ̆ͩ̃̚͘͢ͅ3̖̰̙ͯͥ̿͞4̣̘̆ͪ͝g͙̜̻͐ͬ͊̏̑̐̓f̴̧̨̧̪̲̓ͫͧ̆̀́͛̄̃̀̽̃͆͐̉̓͝͞͡ 3̶̡̡̛̘̤͖̖̼̹͇̘͙̰̤̥ͣ͋͑̿̇̓̌̔ͪ́ͥ̍ͪ̏ͪ̚̕̚͞ͅ4̸̡̢̛̠̲̩̫͖̳͍̰̰̦͔͎̥̍ͧ͗͂̆͌͌̃̚̕͝ͅt̼̬͚͈̼̣̘ͭ͒̆̇̌̉ͣͥ͢d̸̷̳̗̃̈̎ͭ̕͜͢_̧͓͚͙̤͈͖͉͍̫͚͎ͩ̐̇̌ͫ̌ͥ́̀̒ͮ̈̒̑͂̍̎̃̚͡͠ș̴̶̛̰̥͍͍͙͈͈̜̘̭̙̭ͩ̈̓̉ͩͯ̆̾̏ͭ͆̄͗̀͊ͨ̾ͦ̐̉̚͜͢͞͠͝͡ǵ̸̴͕̱ͩͨsͧǧ̷̢̨͉̫̰̠̝̻̰̣̤̅ͭ̽̍͐̾͋͛̃̏͐͒ͫ̕͟͜͝͞͡͡ͅͅḑ̷̡̛͈̲̹̇̉̉ͮͫ͒̀̋͐ͣͣ̒̂ͯ͟g͈ͮ̿̔̉̉ 5͉̥͈̰̠͕͎̖̣ͭ͗̂͒̍̌͋͒͑̄̕͟͠͝ͅ4̷̢̧̛͓̰͇̗̬̬̱̩̹͎̼̘͐ͨ͌ͩ̀͐̌̃̓ͪͫ̆ͭͩ̏̒͌͂̕͜͢͝͡</strong></p> 
                <a href="https://www.youtube.com/watch?v=ns1SGo3WCF4">c̰̼̭̺̙͉̥̻͆ͫ̊ͮ̒ͯ̈̊ͯ̉͘l̴͙͙̬͈̮̼̱̺͉̓ͤ̉̍͆̒̀̇ͬ̆̀͠_͔̠̃̄ͣ͛̑͜͞i̶͙͙͈̖ͫ͐̇̇ͣͪ́̚͟͝ċ̛̛͉̣̥̗̣ḵ̴͙̞̤̗̠̣̭͊͂͗̑ͪ</a>
            </body>
            </html>
        "#.to_string())
    }
}

async fn to_age(Form(form): Form<HashMap<String, String>>) -> Html<String> {
    if let Some(age_str) = form.get("age") {
        if let Ok(age) = age_str.parse::<u32>() {
            if age > 14 {
                let html = r#"
                    <!DOCTYPE html>
                    <html lang="en">
                    <head>
                        <meta charset="UTF-8">
                        <title>Submission Successful</title>
                    </head>
                    <body>
                        <h1>I'm 14!</h1>
                        <h2>Woah, you're old!</h2>
                        <button type="submit" name="to_age" value="submit">Next</button>
                    </body>
                    </html>
                "#.to_string();
                return Html(html);
            } else if age < 14 {
                let html = r#"
                    <!DOCTYPE html>
                    <html lang="en">
                    <head>
                        <meta charset="UTF-8">
                        <title>Submission Successful</title>
                    </head>
                    <body>
                        <h1>I'm 14!</h1>
                        <h2>Little guy!</h2>
                        <button type="submit" name="to_age" value="submit">Next</button>
                    </body>
                    </html>
                "#.to_string();
                return Html(html);
            } else {
                let html = r#"
                    <!DOCTYPE html>
                    <html lang="en">
                    <head>
                        <meta charset="UTF-8">
                        <title>Submission Successful</title>
                    </head>
                    <body>
                        <h1>I'm 14!</h1>
                        <h2>We're the same age!</h2>
                        <button type="submit" name="to_age" value="submit">Next</button>
                    </body>
                    </html>
                "#.to_string();
                return Html(html);
            }
        }
    }
    
    let html = r#"
        <!DOCTYPE html>
        <html lang="en">
        <head>
            <meta charset="UTF-8">
            <meta name="viewport" content="width=device-width, initial-scale=1.0">
            <title>Age</title>
        </head>
        <body>
            <h1>How old are you?</h1>
            <form action="/age" method="post">
                <input type="number" name="age" id="age">
                <button type="submit">Submit</button>
            </form>
        </body>
        </html>
    "#.to_string();

    Html(html)
}